tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j93_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F67J93_H_
#define _PIC18F67J93_H_

#define PADCFG1                       0
#define RTSECSEL0                     1
#define RTSECSEL1                     2
#define CTMUICON                      3
#define IRNG                          4
#define IRNG0                         5
#define IRNG1                         6
#define ITRIM0                        7
#define ITRIM                         8
#define ITRIM1                        9
#define ITRIM2                        10
#define ITRIM3                        11
#define ITRIM4                        12
#define ITRIM5                        13
#define CTMUCONL                      14
#define EDG1STAT                      15
#define EDG2STAT                      16
#define EDG1SEL0                      17
#define EDG1SEL1                      18
#define EDG1POL                       19
#define EDG2SEL0                      20
#define EDG2SEL1                      21
#define EDG2POL                       22
#define CTMUCONH                      23
#define CTTRIG                        24
#define IDISSEN                       25
#define EDGSEQEN                      26
#define EDGEN                         27
#define TGEN                          28
#define CTMUSIDL                      29
#define CTMUEN                        30
#define ALRMVALL                      31
#define ALRMVALH                      32
#define ALRMRPT                       33
#define ARPT0                         34
#define ARPT                          35
#define ARPT1                         36
#define ARPT2                         37
#define ARPT3                         38
#define ARPT4                         39
#define ARPT5                         40
#define ARPT6                         41
#define ARPT7                         42
#define ALRMCFG                       43
#define ALRMPTR                       44
#define ALRMPTR0                      45
#define ALRMPTR1                      46
#define AMASK0                        47
#define AMASK                         48
#define AMASK1                        49
#define AMASK2                        50
#define AMASK3                        51
#define CHIME                         52
#define ALRMEN                        53
#define RTCVALL                       54
#define WAITE0                        55
#define RTCVALH                       56
#define WAITE1                        57
#define WAITM0                        58
#define WAITM1                        59
#define WAITM2                        60
#define WAITM3                        61
#define WAITB0                        62
#define WAITB1                        63
#define RTCCAL                        64
#define CAL0                          65
#define CAL                           66
#define CAL1                          67
#define CAL2                          68
#define CAL3                          69
#define CAL4                          70
#define CAL5                          71
#define CAL6                          72
#define CAL7                          73
#define RTCCFG                        74
#define RTCPTR0                       75
#define RTCPTR1                       76
#define RTCOE                         77
#define HALFSEC                       78
#define RTCSYNC                       79
#define RTCWREN                       80
#define RTCEN                         81
#define RCSTA2                        82
#define RCD82                         83
#define RX9D2                         84
#define RCSTA2_RCD8                   85
#define RCSTA2_RX9D                   86
#define RCSTA2_OERR                   87
#define OERR2                         88
#define FERR2                         89
#define RCSTA2_FERR                   90
#define ADDEN2                        91
#define RCSTA2_ADDEN                  92
#define RCSTA2_CREN                   93
#define CREN2                         94
#define SREN2                         95
#define RCSTA2_SREN                   96
#define RC92                          97
#define RCSTA2_RX9                    98
#define RCSTA2_NOT_RC8                99
#define RCSTA2_RC9                    100
#define RC8_92                        101
#define RCSTA2_RC8_9                  102
#define RX92                          103
#define RCSTA2_SPEN                   104
#define SPEN2                         105
#define TXSTA2                        106
#define TXSTA2_TXD8                   107
#define TX9D2                         108
#define TXSTA2_TX9D                   109
#define TXD82                         110
#define TRMT2                         111
#define TXSTA2_TRMT                   112
#define BRGH2                         113
#define TXSTA2_BRGH                   114
#define SENDB2                        115
#define TXSTA2_SYNC                   116
#define SYNC2                         117
#define TXEN2                         118
#define TXSTA2_TXEN                   119
#define TX8_92                        120
#define TX92                          121
#define TXSTA2_TX9                    122
#define TXSTA2_NOT_TX8                123
#define TXSTA2_TX8_9                  124
#define TXSTA2_CSRC                   125
#define CSRC2                         126
#define TXREG2                        127
#define RCREG2                        128
#define SPBRG2                        129
#define CCP2CON                       130
#define CCP2M                         131
#define CCP2M0                        132
#define CCP2M1                        133
#define CCP2M2                        134
#define CCP2M3                        135
#define DC2B0                         136
#define DCCP2Y                        137
#define DC2B                          138
#define DC2B1                         139
#define DCCP2X                        140
#define CCPR2L                        141
#define CCPR2H                        142
#define CCP1CON                       143
#define CCP1M0                        144
#define CCP1M                         145
#define CCP1M1                        146
#define CCP1M2                        147
#define CCP1M3                        148
#define DCCP1Y                        149
#define DC1B                          150
#define DC1B0                         151
#define DCCP1X                        152
#define DC1B1                         153
#define CCPR1L                        154
#define CCPR1H                        155
#define SEG0COM1                      156
#define LCDDATA6                      157
#define S00C1                         158
#define S0C1                          159
#define S01C1                         160
#define SEG1COM1                      161
#define S1C1                          162
#define S02C1                         163
#define S2C1                          164
#define SEG2COM1                      165
#define S03C1                         166
#define SEG3COM1                      167
#define S3C1                          168
#define SEG4COM1                      169
#define S4C1                          170
#define S04C1                         171
#define S5C1                          172
#define S05C1                         173
#define SEG5COM1                      174
#define SEG6COM1                      175
#define S6C1                          176
#define S06C1                         177
#define SEG7COM1                      178
#define S7C1                          179
#define S07C1                         180
#define LCDDATA7                      181
#define S08C1                         182
#define S8C1                          183
#define SEG8COM1                      184
#define SEG9COM1                      185
#define S09C1                         186
#define S9C1                          187
#define S10C1                         188
#define SEG10COM1                     189
#define S11C1                         190
#define SEG11COM1                     191
#define S12C1                         192
#define SEG12COM1                     193
#define S13C1                         194
#define SEG13COM1                     195
#define S14C1                         196
#define SEG14COM1                     197
#define SEG15COM1                     198
#define S15C1                         199
#define SEG16COM1                     200
#define LCDDATA8                      201
#define S16C1                         202
#define SEG17COM1                     203
#define S17C1                         204
#define SEG18COM1                     205
#define S18C1                         206
#define S19C1                         207
#define SEG19COM1                     208
#define S20C1                         209
#define SEG20COM1                     210
#define S21C1                         211
#define SEG21COM1                     212
#define SEG22COM1                     213
#define S22C1                         214
#define S23C1                         215
#define SEG23COM1                     216
#define S24C1                         217
#define SEG24COM1                     218
#define LCDDATA9                      219
#define S25C1                         220
#define SEG25COM1                     221
#define S26C1                         222
#define SEG26COM1                     223
#define SEG27COM1                     224
#define S27C1                         225
#define SEG28COM1                     226
#define S28C1                         227
#define SEG29COM1                     228
#define S29C1                         229
#define SEG30COM1                     230
#define S30C1                         231
#define S31C1                         232
#define SEG31COM1                     233
#define S32C1                         234
#define SEG32COM1                     235
#define LCDDATA10                     236
#define SEG0COM2                      237
#define SSPM012                       238
#define LCDDATA12                     239
#define S00C2                         240
#define S0C2                          241
#define S01C2                         242
#define SSPM112                       243
#define SEG1COM2                      244
#define S1C2                          245
#define S02C2                         246
#define S2C2                          247
#define SEG2COM2                      248
#define SSPM212                       249
#define S03C2                         250
#define SEG3COM2                      251
#define S3C2                          252
#define SSPM312                       253
#define SEG4COM2                      254
#define S4C2                          255
#define S04C2                         256
#define S5C2                          257
#define S05C2                         258
#define SEG5COM2                      259
#define SEG6COM2                      260
#define S6C2                          261
#define S06C2                         262
#define SEG7COM2                      263
#define S7C2                          264
#define S07C2                         265
#define LCDDATA13                     266
#define S08C2                         267
#define S8C2                          268
#define SEG8COM2                      269
#define SEG9COM2                      270
#define S09C2                         271
#define S9C2                          272
#define S10C2                         273
#define SEG10COM2                     274
#define SEG11COM2                     275
#define S11C2                         276
#define S12C2                         277
#define SEG12COM2                     278
#define S13C2                         279
#define SEG13COM2                     280
#define S14C2                         281
#define SEG14COM2                     282
#define S15C2                         283
#define SEG15COM2                     284
#define SEG16COM2                     285
#define S16C2                         286
#define LCDDATA14_MSK0                287
#define LCDDATA14                     288
#define S17C2                         289
#define LCDDATA14_MSK1                290
#define SEG17COM2                     291
#define LCDDATA14_MSK2                292
#define S18C2                         293
#define SEG18COM2                     294
#define S19C2                         295
#define SEG19COM2                     296
#define LCDDATA14_MSK3                297
#define LCDDATA14_MSK4                298
#define S20C2                         299
#define SEG20COM2                     300
#define LCDDATA14_MSK5                301
#define S21C2                         302
#define SEG21COM2                     303
#define SEG22COM2                     304
#define LCDDATA14_MSK6                305
#define S22C2                         306
#define LCDDATA14_MSK7                307
#define SEG23COM2                     308
#define S23C2                         309
#define LCDDATA15                     310
#define S24C2                         311
#define SEG24COM2                     312
#define S25C2                         313
#define SEG25COM2                     314
#define S26C2                         315
#define SEG26COM2                     316
#define SEG27COM2                     317
#define S27C2                         318
#define S28C2                         319
#define SEG28COM2                     320
#define SEG29COM2                     321
#define S29C2                         322
#define SEG30COM2                     323
#define S30C2                         324
#define SEG31COM2                     325
#define S31C2                         326
#define LCDDATA16                     327
#define S32C2                         328
#define SEG32COM2                     329
#define T4CKPS016                     330
#define T4CKPS116                     331
#define T4OUTPS016                    332
#define T4OUTPS116                    333
#define T4OUTPS216                    334
#define T4OUTPS316                    335
#define SEG00COM3                     336
#define LCDDATA18                     337
#define S00C3                         338
#define S0C3                          339
#define S01C3                         340
#define SEG01COM3                     341
#define S1C3                          342
#define S02C3                         343
#define SEG02COM3                     344
#define S2C3                          345
#define S03C3                         346
#define S3C3                          347
#define SEG03COM3                     348
#define SEG04COM3                     349
#define S4C3                          350
#define S04C3                         351
#define S5C3                          352
#define SEG05COM3                     353
#define S05C3                         354
#define S6C3                          355
#define SEG06COM3                     356
#define S06C3                         357
#define SEG07COM3                     358
#define S7C3                          359
#define S07C3                         360
#define S8C3                          361
#define SEG8COM3                      362
#define S08C3                         363
#define LCDDATA19                     364
#define S9C3                          365
#define SEG9COM3                      366
#define S09C3                         367
#define SEG10COM3                     368
#define S10C3                         369
#define S11C3                         370
#define SEG11COM3                     371
#define S12C3                         372
#define T3CKPS019                     373
#define SEG12COM3                     374
#define S13C3                         375
#define SEG13COM3                     376
#define T3CKPS119                     377
#define S14C3                         378
#define SEG14COM3                     379
#define TMR3CS019                     380
#define SEG15COM3                     381
#define S15C3                         382
#define TMR3CS119                     383
#define LCDDATA20                     384
#define S16C3                         385
#define SEG16COM3                     386
#define SEG17COM3                     387
#define S17C3                         388
#define SEG18COM3                     389
#define S18C3                         390
#define S19C3                         391
#define SEG19COM3                     392
#define S20C3                         393
#define SEG20COM3                     394
#define SEG21COM3                     395
#define S21C3                         396
#define SEG22COM3                     397
#define S22C3                         398
#define S23C3                         399
#define SEG23COM3                     400
#define S24C3                         401
#define LCDDATA21                     402
#define SEG24COM3                     403
#define S25C3                         404
#define SEG25COM3                     405
#define S26C3                         406
#define SEG26COM3                     407
#define SEG27COM3                     408
#define S27C3                         409
#define SEG28COM3                     410
#define S28C3                         411
#define SEG29COM3                     412
#define S29C3                         413
#define SEG30COM3                     414
#define S30C3                         415
#define SEG31COM3                     416
#define S31C3                         417
#define LCDDATA22                     418
#define S32C3                         419
#define SEG32COM3                     420
#define BAUDCON1                      421
#define ABDEN1                        422
#define ABDEN                         423
#define WUE1                          424
#define W4E                           425
#define WUE                           426
#define BRG161                        427
#define BRG16                         428
#define CKTXP                         429
#define SCKP1                         430
#define TXCKP                         431
#define TXCKP1                        432
#define SCKP                          433
#define DTRXP1                        434
#define RXDTP1                        435
#define DTRXP                         436
#define RXCKP                         437
#define RXDTP                         438
#define RCMT1                         439
#define RCIDL1                        440
#define RCIDL                         441
#define RCMT                          442
#define ABDOVF                        443
#define ABDOVF1                       444
#define SPBRGH1                       445
#define PORTA                         446
#define AN0                           447
#define ULPWUIN                       448
#define RA0                           449
#define SEG18                         450
#define AN1                           451
#define RA1                           452
#define AN2                           453
#define VREFM                         454
#define RA2                           455
#define AN3                           456
#define RA3                           457
#define VREFP                         458
#define TOCKI                         459
#define SEG14                         460
#define RA4                           461
#define SEG15                         462
#define AN4                           463
#define LVDIN                         464
#define RA5                           465
#define CLKO                          466
#define RA6                           467
#define OSC2                          468
#define CLKI                          469
#define PORTA_RJPU                    470
#define OSC1                          471
#define RA7                           472
#define PORTB                         473
#define SEG30                         474
#define RB0                           475
#define INT0                          476
#define RB1                           477
#define INT1                          478
#define SEG8                          479
#define RB2                           480
#define INT2                          481
#define CTED1                         482
#define SEG9                          483
#define SEG10                         484
#define RB3                           485
#define INT3                          486
#define CCP2_PA2                      487
#define CTED2                         488
#define SEG11                         489
#define RB4                           490
#define KBI0                          491
#define RB5                           492
#define SEG29                         493
#define KBI1                          494
#define PGC                           495
#define RB6                           496
#define KBI2                          497
#define PGD                           498
#define RB7                           499
#define KBI3                          500
#define PORTC                         501
#define T13CKI                        502
#define T1OSO                         503
#define RC0                           504
#define SEG32                         505
#define PORTC_CCP2                    506
#define T1OSI                         507
#define PA2                           508
#define RC1                           509
#define SEG13                         510
#define CCP1                          511
#define PA1                           512
#define RC2                           513
#define SEG17                         514
#define SCL                           515
#define SCK                           516
#define RC3                           517
#define SEG16                         518
#define RC4                           519
#define SDA                           520
#define SDI                           521
