tiborsimon/embedded-tdd-headers/pic/pic18/pic18f67j93_tdd.h
#define SEGEN25                       1091
#define SE26                          1092
#define SEGEN26                       1093
#define SE27                          1094
#define SEGEN27                       1095
#define SE28                          1096
#define SEGEN28                       1097
#define SEGEN29                       1098
#define SE29                          1099
#define SE30                          1100
#define SEGEN30                       1101
#define SEGEN31                       1102
#define SE31                          1103
#define SEGEN32                       1104
#define SE32                          1105
#define LCDSE4                        1106
#define SEG0COM0                      1107
#define LCDDATA0                      1108
#define S00C0                         1109
#define S0C0                          1110
#define S01C0                         1111
#define SEG1COM0                      1112
#define S1C0                          1113
#define S02C0                         1114
#define S2C0                          1115
#define SEG2COM0                      1116
#define S03C0                         1117
#define SEG3COM0                      1118
#define S3C0                          1119
#define SEG4COM0                      1120
#define S4C0                          1121
#define S04C0                         1122
#define S5C0                          1123
#define S05C0                         1124
#define SEG5COM0                      1125
#define SEG6COM0                      1126
#define S6C0                          1127
#define S06C0                         1128
#define SEG7COM0                      1129
#define S7C0                          1130
#define S07C0                         1131
#define S08C0                         1132
#define LCDDATA1                      1133
#define S8C0                          1134
#define SEG8COM0                      1135
#define SEG9COM0                      1136
#define S09C0                         1137
#define S9C0                          1138
#define S10C0                         1139
#define SEG10COM0                     1140
#define S11C0                         1141
#define SEG11COM0                     1142
#define S12C0                         1143
#define SEG12COM0                     1144
#define S13C0                         1145
#define SEG13COM0                     1146
#define S14C0                         1147
#define SEG14COM0                     1148
#define SEG15COM0                     1149
#define S15C0                         1150
#define LCDDATA2                      1151
#define S16C0                         1152
#define SEG16COM0                     1153
#define SEG17COM0                     1154
#define S17C0                         1155
#define SEG18COM0                     1156
#define S18C0                         1157
#define S19C0                         1158
#define SEG19COM0                     1159
#define S20C0                         1160
#define SEG20COM0                     1161
#define S21C0                         1162
#define SEG21COM0                     1163
#define SEG22COM0                     1164
#define S22C0                         1165
#define S23C0                         1166
#define SEG23COM0                     1167
#define LCDDATA3                      1168
#define S24C0                         1169
#define SEG24COM0                     1170
#define S25C0                         1171
#define SEG25COM0                     1172
#define S26C0                         1173
#define SEG26COM0                     1174
#define SEG27COM0                     1175
#define S27C0                         1176
#define SEG28COM0                     1177
#define S28C0                         1178
#define SEG29COM0                     1179
#define S29C0                         1180
#define S30C0                         1181
#define SEG30COM0                     1182
#define SEG31COM0                     1183
#define S31C0                         1184
#define S32C0                         1185
#define LCDDATA4                      1186
#define SEG32COM0                     1187
#define SEG33COM0                     1188
#define S33C0                         1189
#define S34C0                         1190
#define SEG34COM0                     1191
#define S35C0                         1192
#define SEG35COM0                     1193
#define S36C0                         1194
#define SEG36COM0                     1195
#define SEG37COM0                     1196
#define S37C0                         1197
#define S38C0                         1198
#define SEG38COM0                     1199
#define SEG39COM0                     1200
#define S39C0                         1201
#define ADCON2                        1202
#define ADCS0                         1203
#define ADCS                          1204
#define ADCS1                         1205
#define ADCS2                         1206
#define ACQT0                         1207
#define ACQT                          1208
#define ACQT1                         1209
#define ACQT2                         1210
#define ADFM                          1211
#define ADCON1                        1212
#define PCFG0                         1213
#define PCFG                          1214
#define PCFG1                         1215
#define PCFG2                         1216
#define CHSN3                         1217
#define PCFG3                         1218
#define VCFG                          1219
#define VCFG0                         1220
#define VCFG01                        1221
#define VCFG11                        1222
#define VCFG1                         1223
#define TRIGSEL                       1224
#define ADCON0                        1225
#define ADON                          1226
#define nDONE                         1227
#define GO_nDONE                      1228
#define NOT_DONE                      1229
#define GODONE                        1230
#define GO_DONE                       1231
#define DONE                          1232
#define GO                            1233
#define GO_NOT_DONE                   1234
#define CHS                           1235
#define CHS0                          1236
#define CHS1                          1237
#define CHS2                          1238
#define CHS3                          1239
#define ADCAL                         1240
#define ADRESL                        1241
#define ADRESH                        1242
#define SSP1CON2                      1243
#define SEN1                          1244
#define SEN                           1245
#define ADMSK11                       1246
#define RSEN1                         1247
#define RSEN                          1248
#define ADMSK1                        1249
#define PEN                           1250
#define ADMSK21                       1251
#define PEN1                          1252
#define ADMSK2                        1253
#define ADMSK31                       1254
#define RCEN                          1255
#define RCEN1                         1256
#define ADMSK3                        1257
#define ACKEN                         1258
#define ACKEN1                        1259
#define ADMSK41                       1260
#define ADMSK4                        1261
#define ACKDT1                        1262
#define ADMSK51                       1263
#define ADMSK5                        1264
#define ACKDT                         1265
#define ACKSTAT                       1266
#define ACKSTAT1                      1267
#define GCEN                          1268
#define GCEN1                         1269
#define SSP1CON1                      1270
#define SSPM0                         1271
#define SSPM                          1272
#define SSPM01                        1273
#define SSPM1                         1274
#define SSPM11                        1275
#define SSPM2                         1276
#define SSPM21                        1277
#define SSPM31                        1278
#define SSPM3                         1279
#define CKP                           1280
#define CKP1                          1281
#define SSPEN                         1282
#define SSPEN1                        1283
#define SSPOV1                        1284
#define SSPOV                         1285
#define WCOL1                         1286
#define WCOL                          1287
#define SSP1STAT                      1288
#define BF                            1289
#define BF1                           1290
#define UA1                           1291
#define UA                            1292
#define R_NOT_W                       1293
#define READ_WRITE                    1294
#define RW1                           1295
#define NOT_W                         1296
#define I2C_READ                      1297
#define nW                            1298
#define RW                            1299
#define nWRITE                        1300
#define R                             1301
#define NOT_WRITE                     1302
#define R_nW                          1303
#define R_W                           1304
#define START                         1305
#define START1                        1306
#define S                             1307
#define I2C_START                     1308
#define STOP                          1309
#define STOP1                         1310
#define I2C_STOP                      1311
#define P                             1312
#define NOT_A                         1313
#define nA                            1314
#define D_A                           1315
#define D_nA                          1316
#define D                             1317
#define DA1                           1318
#define DA                            1319
#define DATA_ADDRESS                  1320
#define D_NOT_A                       1321
#define NOT_ADDRESS                   1322
#define nADDRESS                      1323
#define I2C_DAT                       1324
#define CKE                           1325
#define CKE1                          1326
#define SMP                           1327
#define SMP1                          1328
#define SSP1ADD                       1329
#define SSP1ADD_MSK0                  1330
#define MSK01                         1331
#define SSPADD                        1332
#define SSP1ADD_MSK1                  1333
#define MSK11                         1334
#define SSP1ADD_MSK2                  1335
#define MSK21                         1336
#define MSK31                         1337
#define SSP1ADD_MSK3                  1338
#define SSP1ADD_MSK4                  1339
#define MSK41                         1340
#define MSK51                         1341
#define SSP1ADD_MSK5                  1342
#define MSK61                         1343
#define SSP1ADD_MSK6                  1344
#define SSP1ADD_MSK7                  1345
#define MSK71                         1346
#define SSP1BUF                       1347
#define SSPBUF                        1348
#define T2CON                         1349
#define T2CKPS0                       1350
#define T2CKPS                        1351
#define T2CKPS1                       1352
#define TMR2ON                        1353
#define T2OUTPS0                      1354
#define T2OUTPS                       1355
#define T2OUTPS1                      1356
#define T2OUTPS2                      1357
#define T2OUTPS3                      1358
#define WM0                           1359
#define PR2                           1360
#define WM1                           1361
#define WAIT0                         1362
#define WAIT1                         1363
#define EBDIS                         1364
#define TMR2                          1365
#define T1CON                         1366
#define TMR1ON                        1367
#define TMR1CS                        1368
#define NOT_T1SYNC                    1369
#define T1SYNC                        1370
#define nT1SYNC                       1371
#define T1INSYNC                      1372
#define T1OSCEN                       1373
#define SOSCEN                        1374
#define T1CKPS0                       1375
#define T1CKPS                        1376
#define T1CKPS1                       1377
#define T1RUN                         1378
#define T1RD16                        1379
#define T1CON_RD16                    1380
#define TMR1L                         1381
#define TMR1H                         1382
#define RCON                          1383
#define BOR                           1384
#define NOT_BOR                       1385
#define nBOR                          1386
#define POR                           1387
#define nPOR                          1388
#define NOT_POR                       1389
#define PD                            1390
#define nPD                           1391
#define NOT_PD                        1392
#define nTO                           1393
#define TO                            1394
#define NOT_TO                        1395
#define nRI                           1396
#define NOT_RI                        1397
#define RI                            1398
#define NOT_CM                        1399
#define RCON_CM                       1400
#define nCM                           1401
#define IPEN                          1402
#define WDTCON                        1403
#define SWDTE                         1404
#define SWDTEN                        1405
#define REGSLP                        1406
#define LCDREG                        1407
#define CKSEL                         1408
#define CKSEL0                        1409
#define CKSEL1                        1410
#define MODE13                        1411
#define BIAS0                         1412
#define BIAS                          1413
#define BIAS1                         1414
#define BIAS2                         1415
#define CPEN                          1416
#define OSCCON                        1417
#define SCS0                          1418
#define SCS                           1419
#define SCS1                          1420
#define IOFS                          1421
#define OSTS                          1422
#define IRCF                          1423
#define IRCF0                         1424
#define IRCF1                         1425
#define IRCF2                         1426
#define IDLEN                         1427
#define T0CON                         1428
#define T0PS                          1429
#define T0PS0                         1430
#define T0PS1                         1431
#define T0PS2                         1432
#define PSA                           1433
#define T0SE                          1434
#define T0CS                          1435
#define T08BIT                        1436
#define TMR0ON                        1437
#define TMR0L                         1438
#define TMR0H                         1439
#define STATUS                        1440
#define C                             1441
#define CARRY                         1442
#define DC                            1443
#define ZERO                          1444
#define Z                             1445
#define OV                            1446
#define OVERFLOW                      1447
#define N                             1448
#define NEGATIVE                      1449
#define FSR2L                         1450
#define PLUSW2                        1451
#define PREINC2                       1452
#define POSTDEC2                      1453
#define POSTINC2                      1454
#define INDF2                         1455
#define FSR1L                         1456
#define PLUSW1                        1457
#define PREINC1                       1458
#define POSTDEC1                      1459
#define POSTINC1                      1460
#define INDF1                         1461
#define WREG                          1462
#define FSR0L                         1463
#define PLUSW0                        1464
#define PREINC0                       1465
#define POSTDEC0                      1466
#define POSTINC0                      1467
#define INDF0                         1468
#define INTCON3                       1469
#define INT1IF                        1470
#define INT1F                         1471
#define INT2IF                        1472
#define INT2F                         1473
#define INT3F                         1474
#define INT3IF                        1475
#define INT1E                         1476
#define INT1IE                        1477
#define INT2IE                        1478
#define INT2E                         1479
#define INT3E                         1480
#define INT3IE                        1481
#define INT1P                         1482
#define INT1IP                        1483
#define INT2IP                        1484
#define INT2P                         1485
#define INTCON2                       1486
#define RBIP                          1487
#define INT3IP                        1488
#define INT3P                         1489
#define TMR0IP                        1490
#define T0IP                          1491
#define INTEDG3                       1492
#define INTEDG2                       1493
#define INTEDG1                       1494
#define INTEDG0                       1495
#define RBPU                          1496
#define NOT_RBPU                      1497
#define nRBPU                         1498
#define INTCON                        1499
#define RBIF                          1500
#define INT0F                         1501
#define INT0IF                        1502
#define T0IF                          1503
#define TMR0IF                        1504
#define RBIE                          1505
#define INT0E                         1506
#define INT0IE                        1507
#define T0IE                          1508
#define TMR0IE                        1509
#define PEIE                          1510
#define PEIE_GIEL                     1511
#define GIEL                          1512
#define GIE_GIEH                      1513
#define GIE                           1514
#define GIEH                          1515
#define PRODL                         1516
#define PRODH                         1517
#define TABLAT                        1518
#define TBLPTRL                       1519
#define TBLPTRH                       1520
#define PCL                           1521
#define PCLATH                        1522
#define PCH                           1523
#define SP0                           1524
#define STKPTR                        1525
#define STKPTR0                       1526
#define SP1                           1527
#define STKPTR1                       1528
#define STKPTR2                       1529
#define SP2                           1530
#define SP3                           1531
#define STKPTR3                       1532
#define STKPTR4                       1533
#define SP4                           1534
#define STKUNF                        1535
#define STKOVF                        1536
#define STKFUL                        1537
#define TOSL                          1538
#define TOSH                          1539

#endif // _PIC18F67J93_H_
